151) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Form/LoginForm.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     protected int $id = 0;
     public string $_username = '';
     public string $_password = '';
-    public function getId() : int
+    protected function getId() : int
     {
         return $this->id;
     }
 }
