1) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/LayoutDataProvider.php:36    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function supports(string $resourceClass, string $operationName = null, array $context = []) : bool
     {
-        return Layout::class === $resourceClass;
+        return Layout::class !== $resourceClass;
     }
     /** @throws ResourceClassNotSupportedException */
     public function getItem(string $resourceClass, $id, string $operationName = null, array $context = []) : ?Layout

2) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/LayoutDataProvider.php:42    [M] NotIdentical

--- Original
+++ New
@@ @@
     /** @throws ResourceClassNotSupportedException */
     public function getItem(string $resourceClass, $id, string $operationName = null, array $context = []) : ?Layout
     {
-        if ('default' !== $id) {
+        if ('default' === $id) {
             throw new ResourceClassNotSupportedException('LayoutDataProvider only supports the id `default`');
         }
         return $this->repository->findOneBy(['default' => true]);
     }

3) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/LayoutDataProvider.php:43    [M] Throw_

--- Original
+++ New
@@ @@
     public function getItem(string $resourceClass, $id, string $operationName = null, array $context = []) : ?Layout
     {
         if ('default' !== $id) {
-            throw new ResourceClassNotSupportedException('LayoutDataProvider only supports the id `default`');
+            new ResourceClassNotSupportedException('LayoutDataProvider only supports the id `default`');
         }
         return $this->repository->findOneBy(['default' => true]);
     }
 }

4) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/LayoutDataProvider.php:46    [M] TrueValue

--- Original
+++ New
@@ @@
         if ('default' !== $id) {
             throw new ResourceClassNotSupportedException('LayoutDataProvider only supports the id `default`');
         }
-        return $this->repository->findOneBy(['default' => true]);
+        return $this->repository->findOneBy(['default' => false]);
     }
 }

5) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/LayoutDataProvider.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ('default' !== $id) {
             throw new ResourceClassNotSupportedException('LayoutDataProvider only supports the id `default`');
         }
-        return $this->repository->findOneBy(['default' => true]);
+        return $this->repository->findOneBy([]);
     }
 }

6) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DataProvider/Item/RouteDataProvider.php:40    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function supports(string $resourceClass, string $operationName = null, array $context = []) : bool
     {
-        return Route::class === $resourceClass;
+        return Route::class !== $resourceClass;
     }
 }

7) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/CompilerPass/DoctrineCompilerPass.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function process(ContainerBuilder $container)
     {
-        DoctrineOrmMappingsPass::createAnnotationMappingDriver([__NAMESPACE__ . '\\Entity'], [__DIR__ . '/Entity']);
+        
     }
 }

8) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/CompilerPass/DoctrineCompilerPass.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function process(ContainerBuilder $container)
     {
-        DoctrineOrmMappingsPass::createAnnotationMappingDriver([__NAMESPACE__ . '\\Entity'], [__DIR__ . '/Entity']);
+        DoctrineOrmMappingsPass::createAnnotationMappingDriver([__NAMESPACE__ . '\\Entity'], []);
     }
 }

9) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/CompilerPass/DoctrineCompilerPass.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function process(ContainerBuilder $container)
     {
-        DoctrineOrmMappingsPass::createAnnotationMappingDriver([__NAMESPACE__ . '\\Entity'], [__DIR__ . '/Entity']);
+        DoctrineOrmMappingsPass::createAnnotationMappingDriver([], [__DIR__ . '/Entity']);
     }
 }

10) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/Configuration.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $treeBuilder = new TreeBuilder('silverback_api_component');
         $rootNode = $treeBuilder->getRootNode();
-        $rootNode->children()->scalarNode('table_prefix')->defaultValue('_acb_')->end()->end();
+        
         return $treeBuilder;
     }
 }

11) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $configuration = new Configuration();
         $config = $this->processConfiguration($configuration, $configs);
-        $this->loadServiceConfig($container);
+        
         $definition = $container->getDefinition(TablePrefixExtension::class);
         $definition->setArgument('$prefix', $config['table_prefix']);
     }

12) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $config = $this->processConfiguration($configuration, $configs);
         $this->loadServiceConfig($container);
         $definition = $container->getDefinition(TablePrefixExtension::class);
-        $definition->setArgument('$prefix', $config['table_prefix']);
+        
     }
     /**
      * @throws Exception

13) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         //        $container->registerForAutoconfiguration(ComponentInterface::class)
         //            ->addTag('silverback_api_component.entity.component');
         $loader = new PhpFileLoader($container, new FileLocator(__DIR__ . '/../Resources/config'));
-        $loader->load('services.php');
+        
     }
     public function prepend(ContainerBuilder $container) : void
     {

14) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function prepend(ContainerBuilder $container) : void
     {
-        $container->prependExtensionConfig('api_platform', []);
+        
         $bundles = $container->getParameter('kernel.bundles');
         if (isset($bundles['DoctrineBundle'])) {
             $this->prependDoctrineConfig($container);

15) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->prependExtensionConfig('api_platform', []);
         $bundles = $container->getParameter('kernel.bundles');
         if (isset($bundles['DoctrineBundle'])) {
-            $this->prependDoctrineConfig($container);
+            
         }
         if (isset($bundles['LiipImagineBundle'])) {
             $this->prependLiipConfig($container);

16) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->prependDoctrineConfig($container);
         }
         if (isset($bundles['LiipImagineBundle'])) {
-            $this->prependLiipConfig($container);
+            
         }
     }
     private function prependDoctrineConfig(ContainerBuilder $container)

17) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:97    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function prependDoctrineConfig(ContainerBuilder $container)
     {
-        $container->prependExtensionConfig('doctrine', []);
+        
     }
     private function prependLiipConfig(ContainerBuilder $container)
     {

18) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:116    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $projectDir = $container->getParameter('kernel.project_dir');
         $uploadsDir = $projectDir . '/var/uploads';
-        if (!@mkdir($uploadsDir) && !is_dir($uploadsDir)) {
+        if (@mkdir($uploadsDir) && !is_dir($uploadsDir)) {
             throw new RuntimeException(sprintf('Directory "%s" was not created', $uploadsDir));
         }
     }

19) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:116    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $projectDir = $container->getParameter('kernel.project_dir');
         $uploadsDir = $projectDir . '/var/uploads';
-        if (!@mkdir($uploadsDir) && !is_dir($uploadsDir)) {
+        if (!@mkdir($uploadsDir) && is_dir($uploadsDir)) {
             throw new RuntimeException(sprintf('Directory "%s" was not created', $uploadsDir));
         }
     }

20) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:116    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $projectDir = $container->getParameter('kernel.project_dir');
         $uploadsDir = $projectDir . '/var/uploads';
-        if (!@mkdir($uploadsDir) && !is_dir($uploadsDir)) {
+        if (!@mkdir($uploadsDir) || !is_dir($uploadsDir)) {
             throw new RuntimeException(sprintf('Directory "%s" was not created', $uploadsDir));
         }
     }

21) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/DependencyInjection/SilverbackApiComponentExtension.php:117    [M] Throw_

--- Original
+++ New
@@ @@
         $projectDir = $container->getParameter('kernel.project_dir');
         $uploadsDir = $projectDir . '/var/uploads';
         if (!@mkdir($uploadsDir) && !is_dir($uploadsDir)) {
-            throw new RuntimeException(sprintf('Directory "%s" was not created', $uploadsDir));
+            new RuntimeException(sprintf('Directory "%s" was not created', $uploadsDir));
         }
     }
 }

72) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws MappingException
      * @throws InvalidArgumentException
      */
-    public function loadClassMetadata(LoadClassMetadataEventArgs $eventArgs) : void
+    protected function loadClassMetadata(LoadClassMetadataEventArgs $eventArgs) : void
     {
         $classMetadata = $eventArgs->getClassMetadata();
         $reflectionName = $classMetadata->getReflectionClass()->getName();

73) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:47    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $classMetadata = $eventArgs->getClassMetadata();
         $reflectionName = $classMetadata->getReflectionClass()->getName();
-        if (AbstractComponent::class !== $reflectionName) {
+        if (AbstractComponent::class === $reflectionName) {
             return;
         }
         $this->addDiscriminatorMap($classMetadata);

74) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (AbstractComponent::class !== $reflectionName) {
             return;
         }
-        $this->addDiscriminatorMap($classMetadata);
+        
     }
     /**
      * @throws MappingException

75) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:58    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @throws MappingException
      * @throws InvalidArgumentException
      */
-    protected function addDiscriminatorMap(ClassMetadata $classMetadata) : void
+    private function addDiscriminatorMap(ClassMetadata $classMetadata) : void
     {
         if ($classMetadata->isRootEntity() && !$classMetadata->isInheritanceTypeNone()) {
             $this->addDefaultDiscriminatorMap($classMetadata);

76) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:60    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function addDiscriminatorMap(ClassMetadata $classMetadata) : void
     {
-        if ($classMetadata->isRootEntity() && !$classMetadata->isInheritanceTypeNone()) {
+        if ($classMetadata->isRootEntity() || !$classMetadata->isInheritanceTypeNone()) {
             $this->addDefaultDiscriminatorMap($classMetadata);
         }
     }

77) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:60    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     protected function addDiscriminatorMap(ClassMetadata $classMetadata) : void
     {
-        if ($classMetadata->isRootEntity() && !$classMetadata->isInheritanceTypeNone()) {
+        if ($classMetadata->isRootEntity() && $classMetadata->isInheritanceTypeNone()) {
             $this->addDefaultDiscriminatorMap($classMetadata);
         }
     }

78) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function addDiscriminatorMap(ClassMetadata $classMetadata) : void
     {
         if ($classMetadata->isRootEntity() && !$classMetadata->isInheritanceTypeNone()) {
-            $this->addDefaultDiscriminatorMap($classMetadata);
+            
         }
     }
     /**

79) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:87    [M] LogicalNot

--- Original
+++ New
@@ @@
         $className = $this->getShortName($class->name);
         $cachedClasses = $cache->getItem(sprintf('silverback_api_component.doctrine.driver_classes.%s', $className));
         $cachedMap = $cache->getItem(sprintf('silverback_api_component.doctrine.components_discriminator_map.%s', $className));
-        if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
+        if ($cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
             $cachedClasses->set($allClasses);
             $cache->save($cachedClasses);
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));

80) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:87    [M] NotIdentical

--- Original
+++ New
@@ @@
         $className = $this->getShortName($class->name);
         $cachedClasses = $cache->getItem(sprintf('silverback_api_component.doctrine.driver_classes.%s', $className));
         $cachedMap = $cache->getItem(sprintf('silverback_api_component.doctrine.components_discriminator_map.%s', $className));
-        if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
+        if (!$cachedClasses->isHit() || $cachedClasses->get() === $allClasses) {
             $cachedClasses->set($allClasses);
             $cache->save($cachedClasses);
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));

81) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:87    [M] LogicalOr

--- Original
+++ New
@@ @@
         $className = $this->getShortName($class->name);
         $cachedClasses = $cache->getItem(sprintf('silverback_api_component.doctrine.driver_classes.%s', $className));
         $cachedMap = $cache->getItem(sprintf('silverback_api_component.doctrine.components_discriminator_map.%s', $className));
-        if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
+        if (!$cachedClasses->isHit() && $cachedClasses->get() !== $allClasses) {
             $cachedClasses->set($allClasses);
             $cache->save($cachedClasses);
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));

82) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $cachedClasses = $cache->getItem(sprintf('silverback_api_component.doctrine.driver_classes.%s', $className));
         $cachedMap = $cache->getItem(sprintf('silverback_api_component.doctrine.components_discriminator_map.%s', $className));
         if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
-            $cachedClasses->set($allClasses);
+            
             $cache->save($cachedClasses);
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));
             $cache->save($cachedMap);

83) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $cachedMap = $cache->getItem(sprintf('silverback_api_component.doctrine.components_discriminator_map.%s', $className));
         if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
             $cachedClasses->set($allClasses);
-            $cache->save($cachedClasses);
+            
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));
             $cache->save($cachedMap);
         }

84) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$cachedClasses->isHit() || $cachedClasses->get() !== $allClasses) {
             $cachedClasses->set($allClasses);
             $cache->save($cachedClasses);
-            $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));
+            
             $cache->save($cachedMap);
         }
         $map = $cachedMap->get();

85) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $cachedClasses->set($allClasses);
             $cache->save($cachedClasses);
             $cachedMap->set($this->getDiscriminatorMap($class, $allClasses));
-            $cache->save($cachedMap);
+            
         }
         $map = $cachedMap->get();
         $class->setDiscriminatorMap($map);

86) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $cache->save($cachedMap);
         }
         $map = $cachedMap->get();
-        $class->setDiscriminatorMap($map);
+        
     }
     /**
      * @throws MappingException

87) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:104    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private function getDiscriminatorMap(ClassMetadata $class, array $allClasses) : array
     {
         $fqcn = $class->getName();
-        $map = [$this->getShortName($class->name) => $fqcn];
+        $map = [];
         $duplicates = [];
         foreach ($allClasses as $subClassCandidate) {
             if (is_subclass_of($subClassCandidate, $fqcn)) {

88) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
     private function getDiscriminatorMap(ClassMetadata $class, array $allClasses) : array
     {
         $fqcn = $class->getName();
-        $map = [$this->getShortName($class->name) => $fqcn];
+        $map = [$this->getShortName($class->name) > $fqcn];
         $duplicates = [];
         foreach ($allClasses as $subClassCandidate) {
             if (is_subclass_of($subClassCandidate, $fqcn)) {

89) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:107    [M] Foreach_

--- Original
+++ New
@@ @@
         $fqcn = $class->getName();
         $map = [$this->getShortName($class->name) => $fqcn];
         $duplicates = [];
-        foreach ($allClasses as $subClassCandidate) {
+        foreach (array() as $subClassCandidate) {
             if (is_subclass_of($subClassCandidate, $fqcn)) {
                 $shortName = $this->getShortName($subClassCandidate);
                 if (isset($map[$shortName])) {

90) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:119    [M] Throw_

--- Original
+++ New
@@ @@
             }
         }
         if ($duplicates) {
-            throw MappingException::duplicateDiscriminatorEntry($class->name, $duplicates, $map);
+            MappingException::duplicateDiscriminatorEntry($class->name, $duplicates, $map);
         }
         return $map;
     }

91) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/DiscriminatorMappingExtension.php:122    [M] ArrayOneItem

--- Original
+++ New
@@ @@
         if ($duplicates) {
             throw MappingException::duplicateDiscriminatorEntry($class->name, $duplicates, $map);
         }
-        return $map;
+        return count($map) > 1 ? array_slice($map, 0, 1, true) : $map;
     }
     /**
      * Gets the lower-case short name of a class.

92) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->prefix = $prefix;
     }
-    public function loadClassMetadata(LoadClassMetadataEventArgs $eventArgs) : void
+    protected function loadClassMetadata(LoadClassMetadataEventArgs $eventArgs) : void
     {
         if (null === $this->prefix) {
             return;

93) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:34    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function loadClassMetadata(LoadClassMetadataEventArgs $eventArgs) : void
     {
-        if (null === $this->prefix) {
+        if (null !== $this->prefix) {
             return;
         }
         $classMetadata = $eventArgs->getClassMetadata();

94) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:39    [M] NotIdentical

--- Original
+++ New
@@ @@
             return;
         }
         $classMetadata = $eventArgs->getClassMetadata();
-        if (0 !== strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
+        if (0 === strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();

95) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:39    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             return;
         }
         $classMetadata = $eventArgs->getClassMetadata();
-        if (0 !== strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
+        if (1 !== strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();

96) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return;
         }
         $classMetadata = $eventArgs->getClassMetadata();
-        if (0 !== strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
+        if (-1 !== strpos($classMetadata->getReflectionClass()->getNamespaceName(), 'Silverback\\ApiComponentBundle\\')) {
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();

97) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:44    [M] LogicalOr

--- Original
+++ New
@@ @@
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();
-        if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
+        if (!$classMetadata->isInheritanceTypeSingleTable() && $classMetadata->getName() === $classMetadata->rootEntityName) {
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {

98) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:44    [M] Identical

--- Original
+++ New
@@ @@
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();
-        if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
+        if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() !== $classMetadata->rootEntityName) {
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {

99) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:44    [M] LogicalNot

--- Original
+++ New
@@ @@
             return;
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();
-        if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
+        if ($classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {

100) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();
         if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
-            $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
+            
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {
             if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] && $mapping['isOwningSide']) {

101) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $converter = new CamelCaseToSnakeCaseNameConverter();
         if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
-            $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
+            $classMetadata->setPrimaryTable([]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {
             if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] && $mapping['isOwningSide']) {

102) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:50    [M] Foreach_

--- Original
+++ New
@@ @@
         if (!$classMetadata->isInheritanceTypeSingleTable() || $classMetadata->getName() === $classMetadata->rootEntityName) {
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
-        foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {
+        foreach (array() as $fieldName => $mapping) {
             if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] && $mapping['isOwningSide']) {
                 $mappedTableName = $mapping['joinTable']['name'];
                 $classMetadata->associationMappings[$fieldName]['joinTable']['name'] = $this->prefix . $mappedTableName;
