103) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:51    [M] Identical

--- Original
+++ New
@@ @@
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {
-            if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] && $mapping['isOwningSide']) {
+            if (ClassMetadataInfo::MANY_TO_MANY !== $mapping['type'] && $mapping['isOwningSide']) {
                 $mappedTableName = $mapping['joinTable']['name'];
                 $classMetadata->associationMappings[$fieldName]['joinTable']['name'] = $this->prefix . $mappedTableName;
             }

104) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Doctrine/Extension/TablePrefixExtension.php:51    [M] LogicalAnd

--- Original
+++ New
@@ @@
             $classMetadata->setPrimaryTable(['name' => $this->prefix . $converter->normalize($classMetadata->getTableName())]);
         }
         foreach ($classMetadata->getAssociationMappings() as $fieldName => $mapping) {
-            if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] && $mapping['isOwningSide']) {
+            if (ClassMetadataInfo::MANY_TO_MANY === $mapping['type'] || $mapping['isOwningSide']) {
                 $mappedTableName = $mapping['joinTable']['name'];
                 $classMetadata->associationMappings[$fieldName]['joinTable']['name'] = $this->prefix . $mappedTableName;
             }

105) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/FileData.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->fileExtension = $fileExtension;
         $this->fileSize = $fileSize;
     }
-    public function getPublicPath() : ?string
+    protected function getPublicPath() : ?string
     {
         return $this->publicPath;
     }

106) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/FileData.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->publicPath;
     }
-    public function getImageData() : ?ImageMetadata
+    protected function getImageData() : ?ImageMetadata
     {
         return $this->imageData;
     }

107) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/FileData.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->imageData;
     }
-    public function getImagineData() : ?array
+    protected function getImagineData() : ?array
     {
         return $this->imagineData;
     }

108) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/FileData.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->imagineData;
     }
-    public function getFileExtension() : ?string
+    protected function getFileExtension() : ?string
     {
         return $this->fileExtension;
     }

109) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/FileData.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->fileExtension;
     }
-    public function getFileSize() : ?float
+    protected function getFileSize() : ?float
     {
         return $this->fileSize;
     }
 }

110) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:39    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $this->filePath = $filePath;
         $this->publicPath = $publicPath;
-        if (!file_exists($filePath)) {
+        if (file_exists($filePath)) {
             throw new FileMissingException(sprintf('The file %s does not exist while constructing %s', $filePath, self::class));
         }
         if ('image/svg+xml' === mime_content_type($filePath)) {

111) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:40    [M] Throw_

--- Original
+++ New
@@ @@
         $this->filePath = $filePath;
         $this->publicPath = $publicPath;
         if (!file_exists($filePath)) {
-            throw new FileMissingException(sprintf('The file %s does not exist while constructing %s', $filePath, self::class));
+            new FileMissingException(sprintf('The file %s does not exist while constructing %s', $filePath, self::class));
         }
         if ('image/svg+xml' === mime_content_type($filePath)) {
             $xmlGet = simplexml_load_string(file_get_contents($filePath));

112) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:43    [M] Identical

--- Original
+++ New
@@ @@
         if (!file_exists($filePath)) {
             throw new FileMissingException(sprintf('The file %s does not exist while constructing %s', $filePath, self::class));
         }
-        if ('image/svg+xml' === mime_content_type($filePath)) {
+        if ('image/svg+xml' !== mime_content_type($filePath)) {
             $xmlGet = simplexml_load_string(file_get_contents($filePath));
             $xmlAttributes = $xmlGet->attributes();
             $this->width = (int) $xmlAttributes->width;

113) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:46    [M] CastInt

--- Original
+++ New
@@ @@
         if ('image/svg+xml' === mime_content_type($filePath)) {
             $xmlGet = simplexml_load_string(file_get_contents($filePath));
             $xmlAttributes = $xmlGet->attributes();
-            $this->width = (int) $xmlAttributes->width;
+            $this->width = $xmlAttributes->width;
             $this->height = (int) $xmlAttributes->height;
         } else {
             if (false === exif_imagetype($filePath)) {

114) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:47    [M] CastInt

--- Original
+++ New
@@ @@
             $xmlGet = simplexml_load_string(file_get_contents($filePath));
             $xmlAttributes = $xmlGet->attributes();
             $this->width = (int) $xmlAttributes->width;
-            $this->height = (int) $xmlAttributes->height;
+            $this->height = $xmlAttributes->height;
         } else {
             if (false === exif_imagetype($filePath)) {
                 throw new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));

115) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:49    [M] Identical

--- Original
+++ New
@@ @@
             $this->width = (int) $xmlAttributes->width;
             $this->height = (int) $xmlAttributes->height;
         } else {
-            if (false === exif_imagetype($filePath)) {
+            if (false !== exif_imagetype($filePath)) {
                 throw new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));
             }
             [$this->width, $this->height] = getimagesize($filePath);

116) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:49    [M] FalseValue

--- Original
+++ New
@@ @@
             $this->width = (int) $xmlAttributes->width;
             $this->height = (int) $xmlAttributes->height;
         } else {
-            if (false === exif_imagetype($filePath)) {
+            if (true === exif_imagetype($filePath)) {
                 throw new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));
             }
             [$this->width, $this->height] = getimagesize($filePath);

117) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:50    [M] Throw_

--- Original
+++ New
@@ @@
             $this->height = (int) $xmlAttributes->height;
         } else {
             if (false === exif_imagetype($filePath)) {
-                throw new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));
+                new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));
             }
             [$this->width, $this->height] = getimagesize($filePath);
             $this->imagineKey = $imagineKey;

118) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             if (false === exif_imagetype($filePath)) {
                 throw new FileNotImageException(sprintf('The file %s is not an image while constructing %s', $filePath, self::class));
             }
-            [$this->width, $this->height] = getimagesize($filePath);
+            [$this->height] = getimagesize($filePath);
             $this->imagineKey = $imagineKey;
         }
     }

119) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
             $this->imagineKey = $imagineKey;
         }
     }
-    public function getWidth() : int
+    protected function getWidth() : int
     {
         return $this->width;
     }

120) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->width;
     }
-    public function getHeight() : int
+    protected function getHeight() : int
     {
         return $this->height;
     }

121) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->height;
     }
-    public function getFilePath() : string
+    protected function getFilePath() : string
     {
         return $this->filePath;
     }

122) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->filePath;
     }
-    public function getPublicPath() : string
+    protected function getPublicPath() : string
     {
         return $this->publicPath;
     }

123) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/File/ImageMetadata.php:78    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->publicPath;
     }
-    public function getImagineKey() : ?string
+    protected function getImagineKey() : ?string
     {
         return $this->imagineKey;
     }
 }

124) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:64    [M] TrueValue

--- Original
+++ New
@@ @@
     private Collection $children;
     private bool $rendered;
     private bool $methodRendered;
-    public function __construct(SymfonyFormView $formView, bool $children = true)
+    public function __construct(SymfonyFormView $formView, bool $children = false)
     {
         $this->rendered = $formView->isRendered();
         $this->methodRendered = $formView->isMethodRendered();

125) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->rendered = $formView->isRendered();
         $this->methodRendered = $formView->isMethodRendered();
-        $this->processViewVars($formView);
+        
         if ($children) {
             $this->children = new ArrayCollection();
             foreach ($formView->getIterator() as $view) {

126) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:71    [M] Foreach_

--- Original
+++ New
@@ @@
         $this->processViewVars($formView);
         if ($children) {
             $this->children = new ArrayCollection();
-            foreach ($formView->getIterator() as $view) {
+            foreach (array() as $view) {
                 $this->addChild($view);
             }
         }

127) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($children) {
             $this->children = new ArrayCollection();
             foreach ($formView->getIterator() as $view) {
-                $this->addChild($view);
+                
             }
         }
     }

128) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:79    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     }
     private function processViewVars(SymfonyFormView $formView) : void
     {
-        $outputVars = array_merge(self::ARRAY_OUTPUT_VARS, self::OUTPUT_VARS);
+        $outputVars = self::OUTPUT_VARS;
         foreach ($outputVars as $var) {
             if (isset($formView->vars[$var])) {
                 $this->vars[$var] = $formView->vars[$var];

129) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:79    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     }
     private function processViewVars(SymfonyFormView $formView) : void
     {
-        $outputVars = array_merge(self::ARRAY_OUTPUT_VARS, self::OUTPUT_VARS);
+        $outputVars = self::ARRAY_OUTPUT_VARS;
         foreach ($outputVars as $var) {
             if (isset($formView->vars[$var])) {
                 $this->vars[$var] = $formView->vars[$var];

130) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:80    [M] Foreach_

--- Original
+++ New
@@ @@
     private function processViewVars(SymfonyFormView $formView) : void
     {
         $outputVars = array_merge(self::ARRAY_OUTPUT_VARS, self::OUTPUT_VARS);
-        foreach ($outputVars as $var) {
+        foreach (array() as $var) {
             if (isset($formView->vars[$var])) {
                 $this->vars[$var] = $formView->vars[$var];
                 $this->convertVarToArray($var);

131) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($outputVars as $var) {
             if (isset($formView->vars[$var])) {
                 $this->vars[$var] = $formView->vars[$var];
-                $this->convertVarToArray($var);
+                
             }
         }
     }

132) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:94    [M] Foreach_

--- Original
+++ New
@@ @@
             /** @var iterable $choices */
             $choices = $this->vars[$var];
             $this->vars[$var] = [];
-            foreach ($choices as $choice) {
+            foreach (array() as $choice) {
                 if (method_exists($choice, 'getMessage')) {
                     $this->vars[$var][] = $choice->getMessage();
                 } else {

133) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:98    [M] CastArray

--- Original
+++ New
@@ @@
                 if (method_exists($choice, 'getMessage')) {
                     $this->vars[$var][] = $choice->getMessage();
                 } else {
-                    $this->vars[$var][] = (array) $choice;
+                    $this->vars[$var][] = $choice;
                 }
             }
         }

134) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:107    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function addChild(SymfonyFormView $formViews) : void
     {
         $formView = new self($formViews);
-        $this->children->add($formView);
+        
     }
     public function getVars() : array
     {

135) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:110    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $formView = new self($formViews);
         $this->children->add($formView);
     }
-    public function getVars() : array
+    protected function getVars() : array
     {
         return $this->vars;
     }

136) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:115    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->vars;
     }
-    public function getChildren() : Collection
+    protected function getChildren() : Collection
     {
         return $this->children;
     }

137) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:120    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->children;
     }
-    public function isRendered() : bool
+    protected function isRendered() : bool
     {
         return $this->rendered;
     }

138) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Dto/Form/FormView.php:125    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->rendered;
     }
-    public function isMethodRendered() : bool
+    protected function isMethodRendered() : bool
     {
         return $this->methodRendered;
     }
 }

139) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Component/Form.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public string $successHandler;
     /** @ApiProperty(writable=false) */
     public FormView $form;
-    public static function loadValidatorMetadata(ClassMetadata $metadata) : void
+    protected static function loadValidatorMetadata(ClassMetadata $metadata) : void
     {
         $metadata->addPropertyConstraints('formType', [new ACBAssert\FormTypeClass(), new Assert\NotBlank()]);
         $metadata->addPropertyConstraint('successHandler', new ACBAssert\FormHandlerClass());
     }

140) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Component/Form.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public FormView $form;
     public static function loadValidatorMetadata(ClassMetadata $metadata) : void
     {
-        $metadata->addPropertyConstraints('formType', [new ACBAssert\FormTypeClass(), new Assert\NotBlank()]);
+        
         $metadata->addPropertyConstraint('successHandler', new ACBAssert\FormHandlerClass());
     }
 }

141) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Component/Form.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public FormView $form;
     public static function loadValidatorMetadata(ClassMetadata $metadata) : void
     {
-        $metadata->addPropertyConstraints('formType', [new ACBAssert\FormTypeClass(), new Assert\NotBlank()]);
+        $metadata->addPropertyConstraints('formType', [new Assert\NotBlank()]);
         $metadata->addPropertyConstraint('successHandler', new ACBAssert\FormHandlerClass());
     }
 }

142) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Component/Form.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function loadValidatorMetadata(ClassMetadata $metadata) : void
     {
         $metadata->addPropertyConstraints('formType', [new ACBAssert\FormTypeClass(), new Assert\NotBlank()]);
-        $metadata->addPropertyConstraint('successHandler', new ACBAssert\FormHandlerClass());
+        
     }
 }

143) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Core/AbstractComponent.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public Collection $componentLocations;
     public function __construct()
     {
-        $this->setId();
+        
         $this->componentLocations = new ArrayCollection();
     }
 }

147) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Core/ComponentLocation.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Collection|AbstractComponent[]|null
      */
-    public function getSortCollection() : ?Collection
+    protected function getSortCollection() : ?Collection
     {
         return $this->componentGroup->componentLocations;
     }
 }

152) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/FileTrait.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
     protected ?string $filePath;
     public ?FileData $fileData;
-    public static function getImagineFilters() : array
+    protected static function getImagineFilters() : array
     {
         return ['thumbnail' => 'thumbnail', 'placeholderSquare' => 'placeholder_square', 'placeholder' => 'placeholder'];
     }

153) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/FileTrait.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public ?FileData $fileData;
     public static function getImagineFilters() : array
     {
-        return ['thumbnail' => 'thumbnail', 'placeholderSquare' => 'placeholder_square', 'placeholder' => 'placeholder'];
+        return ['placeholderSquare' => 'placeholder_square', 'placeholder' => 'placeholder'];
     }
     public function getDirectory() : ?string
     {

154) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/FileTrait.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return ['thumbnail' => 'thumbnail', 'placeholderSquare' => 'placeholder_square', 'placeholder' => 'placeholder'];
     }
-    public function getDirectory() : ?string
+    protected function getDirectory() : ?string
     {
         return null;
     }
 }

156) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     /** @ORM\Column(type="integer") */
     public ?int $sort = 0;
-    public final function calculateSort(?bool $sortLast = null, ?Collection $sortCollection = null) : int
+    protected final function calculateSort(?bool $sortLast = null, ?Collection $sortCollection = null) : int
     {
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();

157) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:32    [M] Identical

--- Original
+++ New
@@ @@
     {
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();
-        if (null === $collection || null === $sortLast) {
+        if (null !== $collection || null === $sortLast) {
             return 0;
         }
         if ($sortLast) {

158) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:32    [M] Identical

--- Original
+++ New
@@ @@
     {
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();
-        if (null === $collection || null === $sortLast) {
+        if (null === $collection || null !== $sortLast) {
             return 0;
         }
         if ($sortLast) {

159) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:32    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();
-        if (null === $collection || null === $sortLast) {
+        if (null === $collection && null === $sortLast) {
             return 0;
         }
         if ($sortLast) {

160) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:33    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();
         if (null === $collection || null === $sortLast) {
-            return 0;
+            return 1;
         }
         if ($sortLast) {
             $lastItem = $collection->last();

161) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
         /** @var Collection|SortableInterface[]|null $collection */
         $collection = $sortCollection ?: $this->getSortCollection();
         if (null === $collection || null === $sortLast) {
-            return 0;
+            return -1;
         }
         if ($sortLast) {
             $lastItem = $collection->last();

162) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:38    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
         if ($sortLast) {
             $lastItem = $collection->last();
-            return $lastItem ? $lastItem->getSort() + 1 : 0;
+            return $lastItem ? $lastItem->getSort() + 1 : 1;
         }
         $firstItem = $collection->first();
         return $firstItem ? $firstItem->getSort() - 1 : 0;

163) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:38    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         if ($sortLast) {
             $lastItem = $collection->last();
-            return $lastItem ? $lastItem->getSort() + 1 : 0;
+            return $lastItem ? $lastItem->getSort() + 1 : -1;
         }
         $firstItem = $collection->first();
         return $firstItem ? $firstItem->getSort() - 1 : 0;

164) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:38    [M] Plus

--- Original
+++ New
@@ @@
         }
         if ($sortLast) {
             $lastItem = $collection->last();
-            return $lastItem ? $lastItem->getSort() + 1 : 0;
+            return $lastItem ? $lastItem->getSort() - 1 : 0;
         }
         $firstItem = $collection->first();
         return $firstItem ? $firstItem->getSort() - 1 : 0;

165) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:38    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
         if ($sortLast) {
             $lastItem = $collection->last();
-            return $lastItem ? $lastItem->getSort() + 1 : 0;
+            return $lastItem ? $lastItem->getSort() + 0 : 0;
         }
         $firstItem = $collection->first();
         return $firstItem ? $firstItem->getSort() - 1 : 0;

166) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:38    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         if ($sortLast) {
             $lastItem = $collection->last();
-            return $lastItem ? $lastItem->getSort() + 1 : 0;
+            return $lastItem ? $lastItem->getSort() + 2 : 0;
         }
         $firstItem = $collection->first();
         return $firstItem ? $firstItem->getSort() - 1 : 0;

167) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:42    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             return $lastItem ? $lastItem->getSort() + 1 : 0;
         }
         $firstItem = $collection->first();
-        return $firstItem ? $firstItem->getSort() - 1 : 0;
+        return $firstItem ? $firstItem->getSort() - 0 : 0;
     }
     public abstract function getSortCollection() : ?Collection;
 }

168) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:42    [M] IncrementInteger

--- Original
+++ New
@@ @@
             return $lastItem ? $lastItem->getSort() + 1 : 0;
         }
         $firstItem = $collection->first();
-        return $firstItem ? $firstItem->getSort() - 1 : 0;
+        return $firstItem ? $firstItem->getSort() - 2 : 0;
     }
     public abstract function getSortCollection() : ?Collection;
 }

169) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:42    [M] Minus

--- Original
+++ New
@@ @@
             return $lastItem ? $lastItem->getSort() + 1 : 0;
         }
         $firstItem = $collection->first();
-        return $firstItem ? $firstItem->getSort() - 1 : 0;
+        return $firstItem ? $firstItem->getSort() + 1 : 0;
     }
     public abstract function getSortCollection() : ?Collection;
 }

170) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:42    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return $lastItem ? $lastItem->getSort() + 1 : 0;
         }
         $firstItem = $collection->first();
-        return $firstItem ? $firstItem->getSort() - 1 : 0;
+        return $firstItem ? $firstItem->getSort() - 1 : -1;
     }
     public abstract function getSortCollection() : ?Collection;
 }

171) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/SortableTrait.php:42    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             return $lastItem ? $lastItem->getSort() + 1 : 0;
         }
         $firstItem = $collection->first();
-        return $firstItem ? $firstItem->getSort() - 1 : 0;
+        return $firstItem ? $firstItem->getSort() - 1 : 1;
     }
     public abstract function getSortCollection() : ?Collection;
 }

172) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/TimestampedTrait.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
     public ?DateTime $modified = null;
     /** @return static */
-    public function setCreated(DateTimeImmutable $created)
+    protected function setCreated(DateTimeImmutable $created)
     {
         if (!$this->created) {
             $this->created = $created;
