173) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/TimestampedTrait.php:44    [M] LogicalNot

--- Original
+++ New
@@ @@
     /** @return static */
     public function setCreated(DateTimeImmutable $created)
     {
-        if (!$this->created) {
+        if ($this->created) {
             $this->created = $created;
         }
         return $this;

175) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Entity/Utility/TimestampedTrait.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this;
     }
-    public function getCreated() : ?DateTimeImmutable
+    protected function getCreated() : ?DateTimeImmutable
     {
         return $this->created;
     }
 }

176) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public static function getSubscribedEvents()
     {
-        return [KernelEvents::VIEW => ['callComponentPopulators', EventPriorities::PRE_SERIALIZE]];
+        return [];
     }
     public function callComponentPopulators(ViewEvent $event)
     {

177) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public static function getSubscribedEvents()
     {
-        return [KernelEvents::VIEW => ['callComponentPopulators', EventPriorities::PRE_SERIALIZE]];
+        return [KernelEvents::VIEW => [EventPriorities::PRE_SERIALIZE]];
     }
     public function callComponentPopulators(ViewEvent $event)
     {

178) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return [KernelEvents::VIEW => ['callComponentPopulators', EventPriorities::PRE_SERIALIZE]];
     }
-    public function callComponentPopulators(ViewEvent $event)
+    protected function callComponentPopulators(ViewEvent $event)
     {
         $route = $event->getControllerResult();
         $method = $event->getRequest()->getMethod();

179) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:39    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $route = $event->getControllerResult();
         $method = $event->getRequest()->getMethod();
-        if (!$route instanceof Route || Request::METHOD_GET !== $method) {
+        if (!$route instanceof Route || Request::METHOD_GET === $method) {
             return;
         }
         // here we will call a service which will be aware of all the component populators

180) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:39    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         $route = $event->getControllerResult();
         $method = $event->getRequest()->getMethod();
-        if (!$route instanceof Route || Request::METHOD_GET !== $method) {
+        if (!$route instanceof Route && Request::METHOD_GET !== $method) {
             return;
         }
         // here we will call a service which will be aware of all the component populators

181) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/EventListener/ApiPlatformSubscriber.php:39    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $route = $event->getControllerResult();
         $method = $event->getRequest()->getMethod();
-        if (!$route instanceof Route || Request::METHOD_GET !== $method) {
+        if ($route instanceof Route || Request::METHOD_GET !== $method) {
             return;
         }
         // here we will call a service which will be aware of all the component populators

182) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Form/AbstractType.php:27    [M] Coalesce

--- Original
+++ New
@@ @@
 {
     public function buildView(FormView $view, FormInterface $form, array $options) : void
     {
-        $view->vars['realtime_validate'] = $options['realtime_validate'] ?? true;
+        $view->vars['realtime_validate'] = true;
         $view->vars['api_request'] = $options['api_request'] ?? true;
         $view->vars['post_app_proxy'] = $options['post_app_proxy'] ?? null;
     }
 }

183) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Form/AbstractType.php:27    [M] TrueValue

--- Original
+++ New
@@ @@
 {
     public function buildView(FormView $view, FormInterface $form, array $options) : void
     {
-        $view->vars['realtime_validate'] = $options['realtime_validate'] ?? true;
+        $view->vars['realtime_validate'] = $options['realtime_validate'] ?? false;
         $view->vars['api_request'] = $options['api_request'] ?? true;
         $view->vars['post_app_proxy'] = $options['post_app_proxy'] ?? null;
     }
 }

184) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Form/AbstractType.php:28    [M] Coalesce

--- Original
+++ New
@@ @@
     public function buildView(FormView $view, FormInterface $form, array $options) : void
     {
         $view->vars['realtime_validate'] = $options['realtime_validate'] ?? true;
-        $view->vars['api_request'] = $options['api_request'] ?? true;
+        $view->vars['api_request'] = true;
         $view->vars['post_app_proxy'] = $options['post_app_proxy'] ?? null;
     }
 }

185) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Form/AbstractType.php:28    [M] TrueValue

--- Original
+++ New
@@ @@
     public function buildView(FormView $view, FormInterface $form, array $options) : void
     {
         $view->vars['realtime_validate'] = $options['realtime_validate'] ?? true;
-        $view->vars['api_request'] = $options['api_request'] ?? true;
+        $view->vars['api_request'] = $options['api_request'] ?? false;
         $view->vars['post_app_proxy'] = $options['post_app_proxy'] ?? null;
     }
 }

186) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Form/AbstractType.php:29    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $view->vars['realtime_validate'] = $options['realtime_validate'] ?? true;
         $view->vars['api_request'] = $options['api_request'] ?? true;
-        $view->vars['post_app_proxy'] = $options['post_app_proxy'] ?? null;
+        $view->vars['post_app_proxy'] = null;
     }
 }

187) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Repository/Core/LayoutRepository.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Layout::class);
+        
     }
 }

188) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Repository/Core/RouteRepository.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Route::class);
+        
     }
     public function findOneByIdOrRoute(string $idOrRoute)
     {

189) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Repository/Core/RouteRepository.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         parent::__construct($registry, Route::class);
     }
-    public function findOneByIdOrRoute(string $idOrRoute)
+    protected function findOneByIdOrRoute(string $idOrRoute)
     {
         $route = $this->findOneBy(['route' => $idOrRoute]);
         if ($route) {

190) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Repository/Core/RouteRepository.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function findOneByIdOrRoute(string $idOrRoute)
     {
-        $route = $this->findOneBy(['route' => $idOrRoute]);
+        $route = $this->findOneBy([]);
         if ($route) {
             return $route;
         }

191) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/SilverbackApiComponentBundle.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function build(ContainerBuilder $container) : void
     {
-        parent::build($container);
+        
         if (class_exists(DoctrineOrmMappingsPass::class)) {
             $container->addCompilerPass(new DoctrineCompilerPass());
         }
     }

192) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/SilverbackApiComponentBundle.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::build($container);
         if (class_exists(DoctrineOrmMappingsPass::class)) {
-            $container->addCompilerPass(new DoctrineCompilerPass());
+            
         }
     }
 }

193) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ClassNameValidator.php:55    [M] Throw_

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException(sprintf('The class/interface %s does not exist', $className));
         }
         if (!\is_object($validClass)) {
-            throw new InvalidArgumentException(sprintf('The $validClass parameter %s is not an object', $validClass));
+            new InvalidArgumentException(sprintf('The $validClass parameter %s is not an object', $validClass));
         }
     }
     /** @throws ReflectionException */

194) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormHandlerClassValidator.php:37    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function validate($value, Constraint $constraint)
     {
-        if (null === $value) {
+        if (null !== $value) {
             return;
         }
         try {

195) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormHandlerClassValidator.php:42    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         try {
             $valid = ClassNameValidator::validate($value, $this->formHandlers);
-            if (!$valid) {
+            if ($valid) {
                 $conditionsStr = vsprintf(' It should implement %s or tagged %s', [FormHandlerInterface::class, 'silverback_api_component.form_handler']);
                 $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
             }

196) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormHandlerClassValidator.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $valid = ClassNameValidator::validate($value, $this->formHandlers);
             if (!$valid) {
-                $conditionsStr = vsprintf(' It should implement %s or tagged %s', [FormHandlerInterface::class, 'silverback_api_component.form_handler']);
+                $conditionsStr = vsprintf(' It should implement %s or tagged %s', ['silverback_api_component.form_handler']);
                 $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
             }
         } catch (InvalidArgumentException $exception) {

197) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormHandlerClassValidator.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $valid = ClassNameValidator::validate($value, $this->formHandlers);
             if (!$valid) {
                 $conditionsStr = vsprintf(' It should implement %s or tagged %s', [FormHandlerInterface::class, 'silverback_api_component.form_handler']);
-                $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
+                
             }
         } catch (InvalidArgumentException $exception) {
             $this->context->buildViolation($constraint->message . ' ' . $exception->getMessage())->setParameter('{{ string }}', $value)->addViolation();

198) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormHandlerClassValidator.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
             }
         } catch (InvalidArgumentException $exception) {
-            $this->context->buildViolation($constraint->message . ' ' . $exception->getMessage())->setParameter('{{ string }}', $value)->addViolation();
+            
         }
     }
 }

199) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormTypeClassValidator.php:42    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         try {
             $valid = ClassNameValidator::validate($value, $this->formTypes);
-            if (!$valid) {
+            if ($valid) {
                 $conditionsStr = vsprintf(' It should extend %s, implement %s or tagged %s', [AbstractType::class, FormTypeInterface::class, 'silverback_api_component.form_type']);
                 $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
             }

200) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormTypeClassValidator.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $valid = ClassNameValidator::validate($value, $this->formTypes);
             if (!$valid) {
-                $conditionsStr = vsprintf(' It should extend %s, implement %s or tagged %s', [AbstractType::class, FormTypeInterface::class, 'silverback_api_component.form_type']);
+                $conditionsStr = vsprintf(' It should extend %s, implement %s or tagged %s', [FormTypeInterface::class, 'silverback_api_component.form_type']);
                 $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
             }
         } catch (InvalidArgumentException $exception) {

201) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/Constraints/FormTypeClassValidator.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $valid = ClassNameValidator::validate($value, $this->formTypes);
             if (!$valid) {
                 $conditionsStr = vsprintf(' It should extend %s, implement %s or tagged %s', [AbstractType::class, FormTypeInterface::class, 'silverback_api_component.form_type']);
-                $this->context->buildViolation($constraint->message . $conditionsStr)->setParameter('{{ string }}', $value)->addViolation();
+                
             }
         } catch (InvalidArgumentException $exception) {
             $this->context->buildViolation($constraint->message . ' ' . $exception->getMessage())->setParameter('{{ string }}', $value)->addViolation();

203) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
  */
 class ImagineSupportedFilePath
 {
-    public static function isValidFilePath(?string $filePath) : bool
+    protected static function isValidFilePath(?string $filePath) : bool
     {
         if (!$filePath || !file_exists($filePath)) {
             return false;

204) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:23    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     public static function isValidFilePath(?string $filePath) : bool
     {
-        if (!$filePath || !file_exists($filePath)) {
+        if (!$filePath || file_exists($filePath)) {
             return false;
         }
         try {

205) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:23    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     public static function isValidFilePath(?string $filePath) : bool
     {
-        if (!$filePath || !file_exists($filePath)) {
+        if ($filePath || !file_exists($filePath)) {
             return false;
         }
         try {

206) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:23    [M] LogicalOr

--- Original
+++ New
@@ @@
 {
     public static function isValidFilePath(?string $filePath) : bool
     {
-        if (!$filePath || !file_exists($filePath)) {
+        if (!$filePath && !file_exists($filePath)) {
             return false;
         }
         try {

207) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:24    [M] FalseValue

--- Original
+++ New
@@ @@
     public static function isValidFilePath(?string $filePath) : bool
     {
         if (!$filePath || !file_exists($filePath)) {
-            return false;
+            return true;
         }
         try {
             $imageType = exif_imagetype($filePath);

208) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:29    [M] FalseValue

--- Original
+++ New
@@ @@
         try {
             $imageType = exif_imagetype($filePath);
         } catch (\Exception $e) {
-            return false;
+            return true;
         }
         return \in_array($imageType, [IMAGETYPE_JPEG, IMAGETYPE_JPEG2000, IMAGETYPE_PNG, IMAGETYPE_GIF], true);
     }
 }

209) /Volumes/Samsung_T5/GitHub/_ComponentsWebApp/ApiComponentBundle_v2/src/Validator/ImagineSupportedFilePath.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             return false;
         }
-        return \in_array($imageType, [IMAGETYPE_JPEG, IMAGETYPE_JPEG2000, IMAGETYPE_PNG, IMAGETYPE_GIF], true);
+        return \in_array($imageType, [IMAGETYPE_JPEG2000, IMAGETYPE_PNG, IMAGETYPE_GIF], true);
     }
 }
